# Hypothesis Testing

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dataset=pd.read_csv(r"D:\Data Science\sales_data.csv")

In [3]:
dataset

,User_ID,Product_ID,Gender,Age,Occupation,City,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,Hyderabad,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,Hyderabad,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,Hyderabad,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,Hyderabad,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,Chennai,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,Bangalore,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,Chennai,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,Bangalore,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,Chennai,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,Bangalore,4+,1,20,NaN,NaN,490

### Null Hypothesis: We Have more than 40% of customer base in bangalore p(bangalore)>40%


### Alternate Hypothesis: We Have less than 40% of customer base in bangalore p(bangalore)<=40%

### Null Hypothesis:  p(bangalore)>0.4
### Alternate Hypothesis: p(bangalore)<0.4

# One Sample Propotion Z test

z=p^-po/sqrt(po(1-po)/n)

p^---Propotion of Hypothesis

po --- Propotion of the data

n-- sample data size

In [22]:
import random

In [5]:
dataset["City"]

0         Hyderabad
1         Hyderabad
2         Hyderabad
3         Hyderabad
4           Chennai
            ...
550063    Bangalore
550064      Chennai
550065    Bangalore
550066      Chennai
550067    Bangalore
Name: City, Length: 550068, dtype: object

In [6]:
sample_data=pd.Series(random.choices(dataset["City"],k=5000))

In [7]:
sample_data

0         Chennai
1         Chennai
2       Hyderabad
3       Bangalore
4         Chennai
          ...
4995    Hyderabad
4996    Bangalore
4997    Bangalore
4998      Chennai
4999      Chennai
Length: 5000, dtype: object

z=p^-po/sqrt(po(1-po)/n)

p^---Propotion of Hypothesis===0.4

po --- Propotion of the sample data===?

n-- sample data size==100

In [8]:
sample_data.value_counts()/sample_data.value_counts().sum()

Bangalore    0.4164
Chennai      0.3188
Hyderabad    0.2648
dtype: float64

In [9]:
propotion=sample_data.value_counts()/sample_data.value_counts().sum()

In [10]:
propotion["Bangalore"]

0.4164

In [11]:
po=propotion["Bangalore"]

In [12]:
po

0.4164

In [13]:
#z=p^-po/sqrt(po(1-po)/n)

zcal=(0.4-po)/np.sqrt((po*(1-po))/000)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: RuntimeWarning: divide by zero encountered in double_scalars
  This is separate from the ipykernel package so we can avoid doing imports until

In [14]:
#Calcualted Z value
zcal

-0.0

In [15]:
#One Tail
#Threshold Z value

#Confidence Level --95%
#Significance Level--0.05
#p value --0.05

In [16]:
ztab=-1.64

In [17]:
if(zcal<ztab):
    print("Reject the Null Hypothesis")
else:
    print("Accept the Null Hypothesis")

Accept the Null Hypothesis

### We are Accepting the Null Hypothesis

### we are significantly conculding that the propotion of bangalore customers is more than 40%

In [18]:
dataset

,User_ID,Product_ID,Gender,Age,Occupation,City,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,Hyderabad,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,Hyderabad,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,Hyderabad,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,Hyderabad,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,Chennai,4+,0,8,NaN,NaN,7969
...,...,...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,M,51-55,13,Bangalore,1,1,20,NaN,NaN,368
550064,1006035,P00375436,F,26-35,1,Chennai,3,0,20,NaN,NaN,371
550065,1006036,P00375436,F,26-35,15,Bangalore,4+,1,20,NaN,NaN,137
550066,1006038,P00375436,F,55+,1,Chennai,2,0,20,NaN,NaN,365
550067,1006039,P00371644,F,46-50,0,Bangalore,4+,1,20,NaN,NaN,490

In [19]:
dataset["Purchase"]

0          8370
1         15200
2          1422
3          1057
4          7969
          ...
550063      368
550064      371
550065      137
550066      365
550067      490
Name: Purchase, Length: 550068, dtype: int64

### Null Hypothesis: The average purchase amount of our customers is 9000


### Alternate Hypothesis: The average purchase amount of our customers is  less than 9000 or greater than 900

### H0=mean(purchase)=9000
### H1=mean(purchase)<9000 OR mean(purchase)>9000

# One sample z test

Zcal=mean of sample data-mean of hypothesis/std

mean of sample data --sample data mean

mean of hypothesis==9000

std--sample data std

Confidence level --95%

In [21]:
dataset["Purchase"]

0          8370
1         15200
2          1422
3          1057
4          7969
          ...
550063      368
550064      371
550065      137
550066      365
550067      490
Name: Purchase, Length: 550068, dtype: int64

In [97]:
sample_data=random.choices(dataset["Purchase"],k=100000)

In [98]:
ms=np.mean(sample_data)

In [106]:
mh=9000

In [107]:
s_std=np.std(sample_data)

In [108]:
zcal=(ms-mh)/s_std

In [109]:
zcal

0.04986099846380042

In [110]:
#Threshold z value

#Confidence level --95% ==0.95

#Significance Level(p value)=1- Confidence level

#1-0.95=0.05

#Two Tail Test
# Significance Level(p value)=0.05/2=0.025

In [111]:
zleft = -1.96
zright = 1.96

In [112]:
if(zcal<zleft or zcal>zright ):
    print("Reject the Null Hypothesis")
else:
    print("Accept the Null Hypothesis")

Accept the Null Hypothesis